//-----------------------------------------------------------------------------
// MY_BSP.c
//
//  Created on	: 2019-7-14
//      Author	: SPY
//		version	: V1.0
//		brief	:
//-----------------------------------------------------------------------------
// Attention:
//

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include "My_BSP.h"
#include "sys.h"

//-----------------------------------------------------------------------------
// Private Define
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Private Function Prototypes
//-----------------------------------------------------------------------------

//===============================================================================



//-----------------------------------------------------------------------------
// Extern Function
// 外部函数
//-----------------------------------------------------------------------------
/*****************************************************************************\
* Function Name   : Init
* Input           : uint32_t uart_bound     [初始化UART波特率]
*                   uint8_t  delay_sysclk   [系统时钟频率]
* Output          : None
* Return          : None
* Description     : 板级初始化，初始化硬件
*                   默认uart波特率为115200
*                   默认系统时钟为168MHz
\*****************************************************************************/
void BSP_Init(uint32_t uart_bound, uint8_t delay_sysclk)
{
    /* 设置系统中断优先级分组2 */
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);

    /* 清空系统时间 */
    System_Tiem_Clear();

    /* 初始化滴答定时器 */
    SysTick_Init();

    /* LED初始化 */
    LED_Init();
    LED_ALL_ON();

    /* 蜂鸣器初始化 */
    Beep_Init();

    /* OLED初始化 */
    OLED_Init();

    /* 按键初始化 */
    KEY_Init();
    
    /* 编码器初始化 */ 
    Encoder_Init_TIM8();
    
    /* 电机初始化 */ 
    ESCON_Init();
    ESCON_PWM_Set(0);

    /* UART1初始化 */
    usart1_init(115200);
    /* UART2初始化 */
    //usart2_init(115200);
    /* UART3初始化 */        /* 警告：一定先初始化电机pwm再初始化串口，否则pwm可能无法输出 */
    //usart3_init(115200);
    /* UART4初始化 */
    //uart4_init(115200);
    /* UART5初始化 */
    //usart5_init(115200);
    
    /* ADC初始化 */
	if(ADS1255_Init()!=0){     //初始化ADS1256的寄存器
		DEBUG("ADS1255 Init Fail......\r\n");
    }
	else{
		DEBUG("ADS1255 Init Success......\r\n");	
    }

	u1_printf("%f\r\n",ReadASingleData(0x01,0x00));     //连续采集8个数据并发送到上位机,A1为Vp,A0为Vn

    delay_ms(900);
    Beep_Play(100);
    LED_ALL_OFF();
    //while(1);
}

/******************* (C) COPYRIGHT 2016 DGVY **********END OF FILE***********/
